#include <stdio.h>

int main() {
    // บรรทัดที่ 1: a = 0.617%
    printf("a=%6.3f%%\n", 0.617); // ใช้ %6.3f คือช่องกว้าง 6 มีทศนิยม 3 ตำแหน่งและชิดขวา

    // บรรทัดที่ 2: b =    25%
    printf("b=%4d%%\n", 25); // %4d คือ ช่องกว้าง 4 ชิดขวา 

    // บรรทัดที่ 3: c = 19.000%
    printf("c =%6.3f%%\n", 19.000); // %6.3f คือช่องกว้าง 6 มีทศนิยม 3 ตำแหน่งและชิดขวา

    // บรรทัดที่ 4: d =     9%
    printf("d  =%-2d%%\n", 9); // คือ ช่องกว้าง 2 ชิดซ้าย

    // บรรทัดที่ 5: e = 124.555%
    printf("e=%7.3f%%\n", 124.555); // %7.3f คือช่องกว้าง 7 มีทศนิยม 3 ตำแหน่งและชิดขวา

    // บรรทัดที่ 6: f = 0.001%
    printf("f=%5.3f%%\n", 0.001); // %5.3f คือช่องกว้าง 5 มีทศนิยม 3 ตำแหน่งและชิดขวา

    return 0;
}